app/Service/KelasServiceImpl.php

select `id` as `id_kelas`, `nama` as `nama_kelas` from `kelas` where `id` = '7' limit 1
---
    public function getActiveClass(string $kelas_kode)
    {
        $kelasActive = collect([]);
        $kelasActive->push(Kelas::select([
            'id as id_kelas',
            'nama as nama_kelas'
        ])->where('id', $kelas_kode)->first());