app/Service/MateriService.php

    public function getMateri(string $kelas_id, string $matpel_id): Collection
    {
        $materials = Pengajaran::where('materials.matpel_kode', '=', $matpel_id)
            ->join('gurus', 'gurus.nip', '=', 'pengajarans.guru_nip')
            ->join('kelas', 'kelas.id', '=', 'pengajarans.kelas_id')
            ->where('pengajarans.kelas_id', '=', $kelas_id)
            ->join('matpels', 'matpels.kode', '=', 'pengajarans.matpel_kode')
            ->join('users', 'users.id', '=', 'gurus.user_id')
            ->join('materials', 'materials.matpel_kode', 'pengajarans.matpel_kode')
            ->select(['pengajarans.*', 'materials.kategori_materi', 'materials.publish_date', 'materials.file_materi', 'materials.nomor_materi', 'kelas.nama  as nama_kelas', 'materials.id as materi_id', 'gurus.gelar_depan', 'gurus.gelar_belakang', 'materials.title', 'materials.kelas_ids', 'matpels.nama as nama_matpel', 'users.name as nama_guru'])
            ->orderBy('materials.nomor_materi', 'desc')
            ->get();
---
select `pengajarans`.*, `materials`.`publish_date`, `materials`.`file_materi`, `materials`.`nomor_materi`, `kelas`.`nama` as `nama_kelas`, `materials`.`id` as `materi_id`, `gurus`.`gelar_depan`, `gurus`.`gelar_belakang`, `materials`.`title`, `materials`.`kelas_ids`, `matpels`.`nama` as `nama_matpel`, `users`.`name` as `nama_guru` from `pengajarans` inner join `gurus` on `gurus`.`nip` = `pengajarans`.`guru_nip` inner join `kelas` on `kelas`.`id` = `pengajarans`.`kelas_id` inner join `matpels` on `matpels`.`kode` = `pengajarans`.`matpel_kode` inner join `users` on `users`.`id` = `gurus`.`user_id` inner join `materials` on `materials`.`matpel_kode` = `pengajarans`.`matpel_kode` where `materials`.`matpel_kode` = 'SDLC' and `pengajarans`.`kelas_id` = '7' order by `materials`.`nomor_materi` desc

    public function getDetailMateri(string $id)
    {
        $materi  = Materi::join('matpels', 'matpels.kode', '=', 'materials.matpel_kode')
            ->join('pengajarans', 'pengajarans.matpel_kode', '=', 'materials.matpel_kode')
            ->join('gurus', 'gurus.nip', '=', 'pengajarans.guru_nip')
            ->join('users', 'users.id', '=', 'gurus.user_id')
            ->where('materials.id', $id)
            ->select([
                'users.name as nama_guru',
                'gurus.user_id',
                'pengajarans.guru_nip',
                'pengajarans.kelas_id',
                'pengajarans.matpel_kode',
                'matpels.nama as nama_matpel',
                'materials.title',
                'materials.nomor_materi as nomor_materi',
                'materials.created_at',
                'materials.description',
                'materials.youtube_id',
                'materials.file_materi'
            ])
            ->first();
---
select `users`.`name` as `nama_guru`, `gurus`.`user_id`, `pengajarans`.`guru_nip`, `pengajarans`.`kelas_id`, `pengajarans`.`matpel_kode`, `matpels`.`nama` as `nama_matpel`, `materials`.`title`, `materials`.`nomor_materi` as `nomor_materi`, `materials`.`created_at`, `materials`.`description`, `materials`.`youtube_id`, `materials`.`file_materi` from `materials` inner join `matpels` on `matpels`.`kode` = `materials`.`matpel_kode` inner join `pengajarans` on `pengajarans`.`matpel_kode` = `materials`.`matpel_kode` inner join `gurus` on `gurus`.`nip` = `pengajarans`.`guru_nip` inner join `users` on `users`.`id` = `gurus`.`user_id` where `materials`.`id` = '019bbb47-5fb7-70da-8ccf-17e15d36cc21' limit 1

    public function getMateriByGuruDanKelas(string $matpel_kode, string $guru_id, string $kelas_kode)
    {
        return Materi::where('materials.matpel_kode', $matpel_kode)
            ->where('materials.created_by_user_id', '=', $guru_id)
            ->get()
            ->filter(function ($mater) use ($kelas_kode) {
                $kelas = is_string($mater->kelas_ids) ? json_decode($mater->kelas_ids, true) : $mater->kelas_ids;
                return collect($kelas)->contains($kelas_kode);
            })
            ->map(function ($value) {
                $fileMateri = is_string($value->file_materi) ? json_decode($value->file_materi, true) : $value->file_materi;
                return [
                    ...$value->toArray(),
                    'jumlahFileMateri' => count($fileMateri)
                ];
            })->values();
---
select * from `materials` where `materials`.`matpel_kode` = 'SDLC' and `materials`.`created_by_user_id` = '763'

    public function simpanMateri(array $data, string $kelas_kode, string $guru_id)
    {
        try {
            $kelass = $data['kelas_ids'] ?? [];
            $matpel = $data['matpel']['kode_matpel'];
            $nomorMateriTerakhir = $this->getMateri($kelas_kode, $matpel)->max('nomor_materi');
<<<<<<< HEAD
            // $user = Siswa::with('user')->whereIn('kelas_id', $kelass)->get();
=======

>>>>>>> 76946a030ba0d6b6fc35535b3510527be5e4305a
            $save = Materi::create([
                'title' => $data['title'],
                'created_by_user_id' => $guru_id,
                'status' => "publish",
                'publish_date' => SupportCarbon::parse($data['publish_date']) ?? now(),
                'description' => $data['description'],
                'file_materi' =>   $data['file_materi'],
                'youtube_id' => Youtube::parseVideoID($data['youtube_id']),
                'kelas_ids' => $kelass,
                'matpel_kode' => $matpel,
                'kategori_materi' => $data['kategori_materi'],
                'nomor_materi' => $nomorMateriTerakhir + 1,
            ]);
<<<<<<< HEAD
=======
            if ($save) {
                $matpel = Matpel::find($matpel);
                $users = Siswa::with('user')->whereIn('kelas_id', $kelass)->get()->pluck('user');
---
select * from `matpels` where `matpels`.`kode` = 'SDLC' limit 1
select * from `siswas` where `kelas_id` in (7)
select * from `users` where `users`.`id` in (397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435)