app/Http/Controllers/Guru/JawabanController.php

    public function __invoke(Request $request, string $id, string $jawaban_id)
    {
        $data = JawabanTugas::select(
            'jawaban_tugas.jawabanID',
            'jawaban_tugas.jawaban',
            'jawaban_tugas.file_url',
            'jawaban_tugas.created_at',
            'matpels.nama as nama_matpel',
            'users.id as user_id',
            'users.name as user_name',

            'siswas.nis',
            'kelas.nama as kelas_nama',
        )
            ->join('users', 'users.id', '=', 'jawaban_tugas.answered_by_id')
            ->leftJoin('siswas', 'siswas.user_id', '=', 'users.id')
            ->leftJoin('kelas', 'kelas.id', '=', 'siswas.kelas_id')
            ->leftJoin('tugas', 'tugas.tugasID', '=', 'jawaban_tugas.tugas_id')
            ->leftJoin("matpels", 'matpels.kode', '=', 'tugas.matpel_kode')
            ->where('jawaban_tugas.jawabanID', $jawaban_id)
            ->firstOrFail();
---
select `jawaban_tugas`.`jawabanID`, `jawaban_tugas`.`jawaban`, `jawaban_tugas`.`file_url`, `jawaban_tugas`.`tugas_id`, `jawaban_tugas`.`created_at`, `matpels`.`nama` as `nama_matpel`, `users`.`id` as `user_id`, `users`.`name` as `user_name`, `siswas`.`nis`, `kelas`.`nama` as `kelas_nama` from `jawaban_tugas` inner join `users` on `users`.`id` = `jawaban_tugas`.`answered_by_id` left join `siswas` on `siswas`.`user_id` = `users`.`id` left join `kelas` on `kelas`.`id` = `siswas`.`kelas_id` left join `tugas` on `tugas`.`tugasID` = `jawaban_tugas`.`tugas_id` left join `matpels` on `matpels`.`kode` = `tugas`.`matpel_kode` where `jawaban_tugas`.`jawabanID` = '019bbb58-34ed-70ba-9070-c91d809e3f60' limit 1