app/Http/Controllers/Guru/TugasController.php

    public function index(Request $request, string $kelas_id, MatpelServiceInterface $matpelService)
    {
        $guruId = $request->user()->id;
        $tugas = Tugas::query()
            ->where('created_by_user_id', $guruId)
            ->join('matpels', 'matpels.kode', '=', 'tugas.matpel_kode')
            ->select(['tugas.*', 'matpels.nama as nama_matpel'])
            ->when($request->keywords, function ($q) use ($request) {
                $keywords = "%{$request->keywords}%";
                $q->where(function ($q) use ($keywords) {
                    $q->where('tugas.title', 'LIKE', $keywords)
                        ->orWhere('matpels.nama', 'LIKE', $keywords);
                });
            })
            ->get();
        $filtered = $tugas->filter(
            fn($item) =>
            $item->receiver_type !== 'class_id' ||
                collect($item->receiver_type_id)->contains($kelas_id)
        );
        $jawabanTugas = JawabanTugas::whereIn('tugas_id', $filtered->pluck('tugasID'))
            ->get()
            ->groupBy('tugas_id');

        $result = $filtered->map(function ($item) use ($jawabanTugas, $kelas_id) {
            $receiverUserList = [];
            $persentase = [];
            if ($item->receiver_type === "siswa_id") {
                $targetUserIds = $item->receiver_type_id;
                $jawaban = $jawabanTugas->get($item->tugasID, collect());
                $jumlahSubmit = $jawaban->whereIn('answered_by_id', $targetUserIds)->count();
                $total = count($targetUserIds);

                $persentase = [
                    'jumlah_submit' => $jumlahSubmit,
                    'total_siswa'   => $total,
                    'persen_submit' => $total > 0 ? round(($jumlahSubmit / $total) * 100, 2) : 0
                ];

                $users = User::whereIn('id', $targetUserIds)
                    ->with(['siswa.kelas'])
                    ->get();

                $receiverUserList = $users->map(function ($u) use ($jawaban) {
                    $isDikerjakan = $jawaban->where('answered_by_id', $u->id)->first();
---
select `tugas`.*, `matpels`.`nama` as `nama_matpel` from `tugas` inner join `matpels` on `matpels`.`kode` = `tugas`.`matpel_kode` where `created_by_user_id` = 763
select * from `jawaban_tugas` where `tugas_id` in ('019bbb4b-309f-71dd-bb8b-9d6dab61a139', '019bbb50-abbd-718b-8ac2-d2763d6d6842', '019bbb51-62e9-709d-9ba6-f58b133fd14a', '019bbb51-88d7-7074-b255-93d67651e0c3', '019bbb55-bc58-7335-81ee-c1602a6c5d41', '019bbb57-0949-7083-a1ae-18f9851e7f40', '019bbb59-7692-7097-b5cc-eebfc2b227a2', '019bbf50-56f3-71b2-84a6-6a0d14f4b3f0', '019bbf58-e434-73fc-aaf8-cc50c5f92e05')

                });
            } else {
                $targetKelasId = $item->receiver_type_id;
                $targetUserIds = User::whereHas('siswa', function ($query) use ($targetKelasId) {
                    $query->where('kelas_id', $targetKelasId);
                })->pluck('id');
---
select `id` from `users` where exists (select * from `siswas` where `users`.`id` = `siswas`.`user_id` and `kelas_id` = 7)

                    'persen_submit' => $totalSiswa > 0 ? round(($jumlahSubmit / $totalSiswa) * 100, 2) : 0
                ];

                $users = User::whereIn('id', $targetUserIds)
                    ->with(['siswa.kelas'])
                    ->get();
---
select * from `kelas` where `kelas`.`id` in (7)
select * from `siswas` where `siswas`.`user_id` in (397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435)
select * from `users` where `id` in (397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435)

                ['receiver_users' => $receiverUserList]
            );
        });
        $infoKelas = Kelas::find($kelas_id);
---
select * from `kelas` where `kelas`.`id` = '7' limit 1

    public function periksaTugas(Request $request, string|null $id = null)
    {

        $jawaban = JawabanTugas::query()
            ->with('nilai') // Load relasi nilai
            ->select([
                'jawaban_tugas.jawabanID',
                'jawaban_tugas.jawabanID as jawaban_id',
                'jawaban_tugas.file_url',
                'jawaban_tugas.created_at',
                'jawaban_tugas.tugas_id',
                'jawaban_tugas.answered_by_id',

                // Data Join
                'users.id as user_id',
                'users.name as user_name',
                'siswas.nis',
                'kelas.nama as kelas_nama',
            ])
            ->join('users', 'users.id', '=', 'jawaban_tugas.answered_by_id')
            ->join('siswas', 'siswas.user_id', '=', 'users.id')
            ->join('kelas', 'kelas.id', '=', 'siswas.kelas_id')
            ->where('jawaban_tugas.tugas_id', $id)
            ->get();
---
select * from `nilais` where `nilais`.`jawaban_id` in ('019bbb58-34ed-70ba-9070-c91d809e3f60')
select `jawaban_tugas`.`jawabanID`, `jawaban_tugas`.`jawabanID` as `jawaban_id`, `jawaban_tugas`.`file_url`, `jawaban_tugas`.`created_at`, `jawaban_tugas`.`tugas_id`, `jawaban_tugas`.`answered_by_id`, `users`.`id` as `user_id`, `users`.`name` as `user_name`, `siswas`.`nis`, `kelas`.`nama` as `kelas_nama` from `jawaban_tugas` inner join `users` on `users`.`id` = `jawaban_tugas`.`answered_by_id` inner join `siswas` on `siswas`.`user_id` = `users`.`id` inner join `kelas` on `kelas`.`id` = `siswas`.`kelas_id` where `jawaban_tugas`.`tugas_id` = '019bbb50-abbd-718b-8ac2-d2763d6d6842'