app/Notifications/NewMateriNotification.php

select * from `users` where `users`.`id` = '763' limit 1
select * from `matpels` where `matpels`.`kode` = 'SDLC' limit 1
---
    public function toArray(object $notifiable): array
    {
        $user = User::find($this->materi->created_by_user_id);
        $matpel = Matpel::find($this->materi->matpel_kode);