app/Http/Controllers/Siswa/NilaiController.php

select * from `nilais` where `siswa_id` is null order by `created_at` desc
select * from `tugas` where `tugas`.`tugasID` in ('019bbb50-abbd-718b-8ac2-d2763d6d6842', '019bbf50-56f3-71b2-84a6-6a0d14f4b3f0')
select * from `users` where `users`.`id` in (763)
---
    public function __invoke(Request $request)
    {
        $siswaId = Auth::user()->id;
        $daftarNilai = Nilai::with(['tugas.mapel', 'tugas.guru'])
            ->where('siswa_id', $siswaId)
            ->latest()
            ->get();