app/Http/Controllers/DashboardController.php

select * from `tugas` where (`receiver_type` = 'class_id' and json_contains(`receiver_type_id`, '7') or `receiver_type` = 'siswa_id' and json_contains(`receiver_type_id`, '397')) and not exists (select * from `jawaban_tugas` where `tugas`.`tugasID` = `jawaban_tugas`.`tugas_id` and `answered_by_id` = 397) and `deadline` > '2026-01-15 02:18:48' order by `deadline` asc limit 5
---
    public function __invoke(Request $request)
    {
        $user = $request->user();
        $pending_tugas = [];
        $active_quizzes = []; // Variabel baru

        if ($user->role === 'siswa') {
            $kelasId = $user->siswa->kelas_id;

            // 1. Logika Tugas (Existing)
            $pending_tugas = Tugas::where(function ($q) use ($kelasId, $user) {
                $q->where('receiver_type', 'class_id')->whereJsonContains('receiver_type_id', $kelasId)
                    ->orWhere('receiver_type', 'siswa_id')->whereJsonContains('receiver_type_id', $user->id);
            })
                ->whereDoesntHave('jawaban', function ($q) use ($user) {
                    $q->where('answered_by_id', $user->id);
                })
                ->where('deadline', '>', now())
                ->with('matpel')
                ->orderBy('deadline', 'asc')
                ->limit(5)
                ->get();