app/Http/Controllers/DiscusionController.php

    public function comments(string $kelas_id, string $matpel_kode, string $id)
    {
        $disc = Discusion::with([
            'user',
            'comments' => function ($query) {
                $query->latest();
            },
            'comments.user'
        ])->where([
            'kelas_id'    => $kelas_id,
            'matpel_kode' => $matpel_kode,
            'id'          => $id,
        ])
            ->firstOrFail();
---
select * from `discusions` where (`kelas_id` = '7' and `matpel_kode` = 'SDLC' and `id` = '9') limit 1
select * from `users` where `users`.`id` in (763)

    public function postComment(Request $request)
    {
        $validated = $request->validate([
            'discusion_id' => 'required|exists:discusions,id',
            'text' => 'required|string',
        ]);

        DiscusionComment::create([
            'discusion_id' => $validated['discusion_id'],
            'user_id' => Auth::user()->id, // Ambil ID dari user yang login
            'text' => $validated['text'],
        ]);
---
insert into `discusion_comments` (`discusion_id`, `user_id`, `text`, `updated_at`, `created_at`) values (14, 397, 'Wkwkw Hahha', '2026-01-15 02:18:00', '2026-01-15 02:18:00')

    public function show(Request $request, KelasServiceInterface $kelasService, string $kelas_id, string $matpels_id)
    {
        $user = Auth::user();

        if ($user->role == 'siswa') {
            $user->with(['siswa.kelas']);
            if ($user->siswa->kelas->id != $kelas_id) {
                return abort(404);
            }
        } else if ($user->role == 'guru') {
            $kelas = $kelasService->getKelasByGuru($request->role_id);
            $isAuthorized = $kelas->contains('id_kelas', $kelas_id);
            if (!$isAuthorized) {
                return abort(404);
            }
        }
        $discussions = Discusion::with(['user', 'matpel', 'comments', 'linkedObject'])
            ->where('kelas_id', $kelas_id)
            ->where('matpel_kode', $matpels_id)
            ->latest()
            ->get()->map(function ($item) {
                $item->created_at_human = $item->created_at->diffForHumans();
                return $item;
            });

        return inertia('siswa/discusion/show', [
            'discussions' => $discussions,
            'kelas_id' => $kelas_id,
            'matpels' => Matpel::find($matpels_id)->first(),
---
select * from `discusions` where `kelas_id` = '7' and `matpel_kode` = 'SDLC' order by `created_at` desc
select * from `matpels` where `matpels`.`kode` in ('SDLC')
select * from `users` where `users`.`id` in (763)
select * from `matpels` where `matpels`.`kode` = 'SDLC' limit 1