app/Http/Controllers/GuruQuizQuestionController.php

select * from `quiz_options` where `quiz_options`.`quiz_question_id` in (1, 2)
select * from `quiz_questions` where `quiz_questions`.`quiz_id` = 1 and `quiz_questions`.`quiz_id` is not null order by `id` desc
---
    public function index(Quiz $quiz)
    {
        $questions = $quiz->questions()
            ->with('options')
            ->orderBy('id', 'desc')
            ->get();