app/Http/Controllers/GuruQuizController.php

    public function create()
    {
        $nip = Auth::user()->guru->nip;

        // Ambil data pengajaran untuk dropdown
        // Kita perlu list Kelas dan Matpel yang unik untuk guru ini
        $pengajarans = Pengajaran::with(['kelas', 'matpel'])
            ->where('guru_nip', $nip)
            ->get();
        return inertia('guru/quiz/create', [
            'kelas_list' => $pengajarans->pluck('kelas')->unique('id')->values(),
            'matpel_list' => $pengajarans->pluck('matpel')->unique('kode')->values(),
        ]);
---
select * from `kelas` where `kelas`.`id` in (1, 2, 4, 5, 7)
select * from `pengajarans` where `guru_nip` = '123456789'
select * from `matpels` where `matpels`.`kode` in ('SDLC')

    public function index(Request $request)
    {
        $user = Auth::user();
        $guruNip = $user->guru->nip;
        $pengajaran = Pengajaran::where('guru_nip', $guruNip)->get();
        $matpelKodeList = $pengajaran->pluck('matpel_kode')->unique();
        $kelasIdList = $pengajaran->pluck('kelas_id')->unique();
        $quizzes = Quiz::query()
            ->with(['kelas', 'matpel'])
            ->whereIn('matpel_kode', $matpelKodeList)
            ->whereIn('kelas_id', $kelasIdList)
            ->latest()
            ->paginate(10);
---
select * from `pengajarans` where `guru_nip` = '123456789'
select * from `kelas` where `kelas`.`id` in (7)
select * from `matpels` where `matpels`.`kode` in ('SDLC')

    public function result(Request $request, Quiz $quiz)
    {
        $search = $request->input('search');
        $kelasId = $request->input('kelas');

        $attempts = $quiz->attempts()
            ->with(['user', 'user.siswa.kelas'])
            ->when($search, function ($q) use ($search) {
                $q->whereHas('user', function ($u) use ($search) {
                    $u->where('name', 'like', "%{$search}%");
                });
            })
            ->when($kelasId, function ($q) use ($kelasId) {
                $q->whereHas('user.siswa', function ($s) use ($kelasId) {
                    $s->where('kelas_id', $kelasId);
                });
            })
            ->latest('finished_at')
            ->get();

        $stats = [
            'average' => $attempts->avg('score'),
            'max' => $attempts->max('score'),
            'min' => $attempts->min('score'),
            'total_students' => $attempts->unique('user_id')->count(),
            'passed' => $attempts->where('score', '>=', $quiz->passing_grade)->count(),
        ];

        $allKelas = Kelas::orderBy('nama', 'asc')->get(); // Sesuaikan nama kolom di DB (misal: nama_kelas)

        return Inertia::render('guru/quiz/result', [
            'quiz' => $quiz->load(['matpel', 'kelas']),
            'attempts' => $attempts,
            'stats' => $stats,
            'allKelas' => $allKelas, // Kirim data kelas ke frontend
            'filters' => [
                'search' => $search,
                'kelas' => $kelasId // Kirim state filter saat ini agar dropdown tidak reset
            ]
        ]);
---
select * from `kelas` where `kelas`.`id` in (7)
select * from `quiz_attempts` where `quiz_attempts`.`quiz_id` = 1 and `quiz_attempts`.`quiz_id` is not null order by `finished_at` desc
select * from `siswas` where `siswas`.`user_id` in (397)
select * from `users` where `users`.`id` in (397)
select * from `kelas` order by `nama` asc