app/Http/Controllers/QuizSiswaController.php

    public function index()
    {

        $user = Auth::user();

        $quizzes = Quiz::with(['matpel', 'guru.user'])
            // ->where('kelas_id', $kelasId) // Uncomment jika sudah ada filter kelas
            ->where('is_published', true)
            ->withCount('questions')
            ->latest()
            ->get()
            ->map(function ($quiz) use ($user) {
                // Cek apakah siswa sudah pernah mengerjakan kuis ini?
                $lastAttempt = QuizAttempt::where('quiz_id', $quiz->id)
                    ->where('user_id', $user->id)
                    ->latest()
                    ->first();

                $quiz->last_attempt = $lastAttempt;
                return $quiz;
            });
---
select * from `users` where `users`.`id` in (763)
select * from `quiz_attempts` where `quiz_id` = 1 and `user_id` = 397 order by `created_at` desc limit 1

    public function show(Quiz $quiz)
    {
        return Inertia::render('siswa/quiz/show', [
            'quiz' => $quiz->load(['matpel', 'kelas', 'guru'])
                ->loadCount('questions'),
        ]);
---
select * from `kelas` where `kelas`.`id` in (7)

    public function start(Quiz $quiz)
    {
        // Cek Max Attempts (Opsional)
        /*
        $count = QuizAttempt::where('quiz_id', $quiz->id)->where('user_id', Auth::id())->count();
        if ($count >= $quiz->max_attempts) {
            return back()->with('error', 'Kesempatan habis.');
        }
        */

        // Buat session attempt baru
        $attempt = QuizAttempt::create([
            'quiz_id' => $quiz->id,
            'user_id' => Auth::id(),
            'started_at' => now(),
        ]);
---
insert into `quiz_attempts` (`quiz_id`, `user_id`, `started_at`, `updated_at`, `created_at`) values (1, 397, '2026-01-14 14:41:05', '2026-01-14 14:41:05', '2026-01-14 14:41:05')

    public function submit(Request $request, QuizAttempt $attempt)
    {
        if ($attempt->finished_at) return redirect()->route('siswa.quiz.result', $attempt->id);

        $answers = $request->input('answers') ?? [];

        DB::transaction(function () use ($attempt, $answers) {
            $totalScore = 0;

            foreach ($answers as $questionId => $optionId) {
                $question = \App\Models\QuizQuestion::find($questionId);
                $selectedOption = \App\Models\QuizOption::find($optionId);

                // Validasi agar tidak error jika optionId null (tidak dijawab)
                $isCorrect = $selectedOption && $selectedOption->is_correct;
                $score = $isCorrect ? $question->points : 0;

                QuizAttemptAnswer::create([
                    'quiz_attempt_id' => $attempt->id,
                    'quiz_question_id' => $questionId,
                    'quiz_option_id' => $optionId,
                ]);

                $totalScore += $score;
            }

            $attempt->update([
                'finished_at' => now(),
                'score' => $totalScore,
            ]);
---
select * from `quiz_questions` where `quiz_questions`.`id` = 1 limit 1
select * from `quiz_options` where `quiz_options`.`id` = 1 limit 1
insert into `quiz_attempt_answers` (`quiz_attempt_id`, `quiz_question_id`, `quiz_option_id`, `updated_at`, `created_at`) values (1, 1, 1, '2026-01-14 14:41:13', '2026-01-14 14:41:13')
update `quiz_attempts` set `finished_at` = '2026-01-14 14:41:13', `score` = 10, `quiz_attempts`.`updated_at` = '2026-01-14 14:41:13' where `id` = 1

    public function result(QuizAttempt $attempt)
    {
        if ($attempt->user_id !== Auth::id()) abort(403);

        $quiz = $attempt->quiz->load('matpel');

        // Hitung statistik sederhana
        $totalQuestions = $quiz->questions()->count();
---
select count(*) as aggregate from `quiz_questions` where `quiz_questions`.`quiz_id` = 1 and `quiz_questions`.`quiz_id` is not null