app/Http/Controllers/TugasSiswaController.php

select * from `tugas` where `tugasID` = '019bbb59-7692-7097-b5cc-eebfc2b227a2' limit 1
insert into `jawaban_tugas` (`tugas_id`, `answered_by_id`, `jawaban`, `file`, `file_url`, `jawabanID`, `updated_at`, `created_at`) values ('019bbb59-7692-7097-b5cc-eebfc2b227a2', 397, null, 'jawaban-tugas/I5b592ZBmyEYm08jj8UgNBqgudKnzgr5zBD3UnTl.json', 'http://localhost:8000/storage/jawaban-tugas/I5b592ZBmyEYm08jj8UgNBqgudKnzgr5zBD3UnTl.json', '019bbb5a-065b-7259-b3fb-af050315d5f3', '2026-01-14 07:13:17', '2026-01-14 07:13:17')
select * from `jawaban_tugas` where (`tugas_id` = '019bbb59-7692-7097-b5cc-eebfc2b227a2' and `answered_by_id` = 397) limit 1
---
    public function kerjakanSimpan(Request $request, string $id)
    {
        $request->validate([
            'tugas_id' => 'nullable|exists:tugas,tugasID',
            'jawaban_text' => 'nullable|string',
            'file' => 'nullable|file|max:10240', // Max 10MB
        ]);

        $tugas_id = $request->tugas_id ?? $id;
        $tugas = Tugas::where('tugasID', $tugas_id)->firstOrFail();
        // Cek Deadline
        if (now()->greaterThan($tugas->deadline)) {
            return back()->with('error', 'Maaf, batas waktu pengumpulan tugas sudah berakhir.');
        }

        $path = null;
        $fileUrl = null;
        $disk = $this->getActiveDisk();

        if ($request->hasFile('file')) {
            try {
                $path = $request->file('file')->store('jawaban-tugas', $disk);
                $fileUrl = Storage::disk($disk)->url($path);
            } catch (Exception $e) {
                dd($e);
                return back()->with('error', 'Gagal upload ke Cloud Storage: ' . $e->getMessage());
            }
            dd($disk);
        }
        // Simpan atau update jawaban di database
        JawabanTugas::updateOrCreate(
            [
                'tugas_id' => $tugas_id,
                'answered_by_id' => $request->user()->id,
            ],
            [
                'jawaban' => $request->jawaban_text,
                'file' => $path,
                'file_url' => $fileUrl
            ]
        );

select * from `tugas` where `tugas`.`tugasID` = '019bbb50-abbd-718b-8ac2-d2763d6d6842' limit 1
select * from `users` where `users`.`id` in (763)
select * from `jawaban_tugas` where `tugas_id` = '019bbb50-abbd-718b-8ac2-d2763d6d6842' and `answered_by_id` = 397 limit 1
select * from `nilais` where `nilais`.`jawaban_id` in ('019bbb58-34ed-70ba-9070-c91d809e3f60')
---
    public function kerjakan(Request $request, string $id)
    {
        $user = $request->user();
        $siswa = $user->siswa;
        $tugas = Tugas::with(['user', 'matpel'])->findOrFail($id);

        $isAssigned = false;
        $receivers = is_array($tugas->receiver_type_id) ? $tugas->receiver_type_id : json_decode($tugas->receiver_type_id, true) ?? [];

        if ($tugas->receiver_type === 'class_id') {
            if ($siswa && in_array($siswa->kelas_id, $receivers)) {
                $isAssigned = true;
            }
        } elseif ($tugas->receiver_type === 'siswa_id') {
            if (in_array($user->id, $receivers)) {
                $isAssigned = true;
            }
        }

        if (!$isAssigned) {
            abort(403, 'Maaf, tugas ini tidak ditugaskan kepada Anda.');
        }

        $submission = JawabanTugas::with(['nilai'])->where('tugas_id', $id)
            ->where('answered_by_id', $user->id)
            ->first();

select * from `nilais` where `nilais`.`tugas_id` in ('019bbb4b-309f-71dd-bb8b-9d6dab61a139', '019bbb50-abbd-718b-8ac2-d2763d6d6842', '019bbb51-62e9-709d-9ba6-f58b133fd14a', '019bbb51-88d7-7074-b255-93d67651e0c3', '019bbb55-bc58-7335-81ee-c1602a6c5d41', '019bbb57-0949-7083-a1ae-18f9851e7f40', '019bbb59-7692-7097-b5cc-eebfc2b227a2', '019bbf50-56f3-71b2-84a6-6a0d14f4b3f0', '019bbf58-e434-73fc-aaf8-cc50c5f92e05', '019bbf6c-adf6-712d-9711-ad1f8d625ebc')
select * from `tugas` where (`receiver_type` = 'siswa_id' and json_contains(`receiver_type_id`, '397')) or (`receiver_type` = 'class_id' and json_contains(`receiver_type_id`, '7'))
select * from `users` where `users`.`id` in (763)
select * from `jawaban_tugas` where `answered_by_id` = 397
---
    public function showTugas(Request $request)
    {
        $userId  = $request->user()->id;
        $kelasId = $request->kelas['id'] ?? null;

        $tugas = Tugas::query()
            ->with(['user', 'matpel', 'nilais'])
            ->where(function ($q) use ($userId) {
                $q->where('receiver_type', 'siswa_id')
                    ->whereJsonContains('receiver_type_id', (int)$userId);
            });

        if ($kelasId) {
            $tugas->orWhere(function ($q) use ($kelasId) {
                $q->where('receiver_type', 'class_id')
                    ->whereJsonContains('receiver_type_id', (int)$kelasId);
            });
        }

        $tugasList = $tugas->get();

        $jawaban = JawabanTugas::where('answered_by_id', $userId)
            ->get()
            ->keyBy('tugas_id');