app/Http/Controllers/Admin/UserManagementController.php

select * from `matpels`
select * from `kelas`
select * from `kelas` where `kelas`.`id` in (1, 2, 4, 5, 7)
---
    public function guru(Request $request)
    {
        $query = User::query()->whereHas('guru');

        if ($request->has('search') && $request->search != '') {
            $search = $request->search;
            $query->where(function (Builder $q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                    ->orWhere('email', 'like', "%{$search}%")
                    ->orWhereHas('guru', function (Builder $qGuru) use ($search) {
                        $qGuru->where('nip', 'like', "%{$search}%");
                    });
            });
        }

        $users = $query->with([
            'guru.matpels',
            'guru.pengajarans.kelas',
            'guru.spesialisMatpel',
            'guru.pengajarans.matpel'
        ])
            ->latest()
            ->paginate(4)
            ->withQueryString();

        return inertia('admin/user-management/guru/index', [
            'users'   => $users,
            'kelas'   => Kelas::all(),
            'matpels' => Matpel::all(),
            'filters' => $request->only(['search']),
        ]);

select * from `kelas` where `kelas`.`id` in (4, 7, 8, 9, 10, 12, 14, 16)
---
    public function siswa(Request $request)
    {
        $query = User::query()->whereHas('siswa');

        if ($request->has('search') && $request->search != '') {
            $search = $request->search;
            $query->where(function (Builder $q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                    ->orWhere('email', 'like', "%{$search}%")
                    ->orWhereHas('siswa', function (Builder $qSiswa) use ($search) {
                        $qSiswa->where('nis', 'like', "%{$search}%");
                    });
            });
        }

        $users = $query->with(['siswa.kelas'])
            ->orderBy('users.name', 'asc') // Urutkan berdasarkan kolom name di tabel users
            ->paginate(5)
            ->withQueryString();